{
    "common": {
        "metadata": {
            "title": "bitrey.dev di Alessandro Amella - Sviluppo Siti Web e Soluzioni Informatiche",
            "description": "Sviluppo siti web per privati e aziende, applicazioni web e software su misura.",
            "siteName": "Alessandro Amella",
            "keywords": "sviluppo siti web, sviluppo software, programmazione, informatica, web development, web design, modena, bologna, itis fermi, università di bologna, brno university of technology, erasmus, radioamatore, radioamatori, radio, telecomunicazioni, elettronica, microcontrollori, trasporti pubblici, urbanistica, fotografia, video editing, djing, videogiochi, game development, github, linkedin, instagram, curriculum vitae, cv, telegram, email, web development, software development, it consulting, consulenza informatica, consulenza it, web, software, app, consulenza, telegram, email, radioamatore, radioamatori, radio, telecomunicazioni, elettronica, microcontrollori, trasporti pubblici, urbanistica, fotografia, video editing, djing, videogiochi, game development, github, linkedin, instagram, curriculum vitae, cv, telegram, email, web development, software development, it consulting, consulenza informatica, consulenza it, web, software, app, consulenza"
        },
        "header": {
            "about": "Info",
            "projects": "Progetti",
            "contact": "Contatti"
        },
        "homepage": {
            "splash": "Alessandro Amella",
            "by": "di",
            "about": "Chi sono",
            "projects": "Progetti",
            "mainDescription": "Studente di Informatica all'Università di Bologna, ex-Erasmus presso la Brno University of Technology, programmatore, {years} anni, vivo a Modena",
            "weather": "ora fanno",
            "descriptions": {
                "0": "Ho iniziato a programmare quando avevo 9 anni e da allora non ho più smesso di esplorare l'informatica in ogni suo ramo.",
                "1": "Studiando prevelantemente da autodidatta, ho proseguito gli studi in informatica-telecomunicazioni presso l'ITIS Fermi di Modena, diplomandomi con 98/100.",
                "2": "Attualmente studio all'Alma Mater, e punto ad un corso di laurea magistrale in ambito AI (da qualche parte)."
            },
            "otherInterests": "Altri miei interessi:",
            "otherInterstsRadio": {
                "title": "Radio e telecomunicazioni: diploma in telecom. e ",
                "urlTitle": "radioamatore",
                "url": "https://www.qrz.com/db/IU4QSG"
            },
            "otherInterestsList": {
                "0": "Elettronica e microcontrollori",
                "1": "Trasporti pubblici e pianificazione urbanistica",
                "2": "Fotografia, video editing e mixing musicale (DJing)",
                "3": "Videogiochi e game development"
            },
            "someProjects": "Alcuni miei progetti",
            "someProjectsDescription": "Questi sono solo alcuni dei progetti che ho realizzato, molti altri sono su GitHub.",
            "github": "GitHub",
            "githubUsername": "Bitrey",
            "linkedin": "LinkedIn",
            "instagram": "Instagram",
            "cv": "Curriculum Vitae",
            "open": "Apri",
            "builtWith": "Realizzato con",
            "andManyOthers": "e molti altri",
            "letsKeepInTouch": "Contatti",
            "contactSubtitle": "Per commissioni, collaborazioni o semplicemente per chiacchierare, puoi contattarmi tramite il seguente form (o i canali in fondo a destra).",
            "otherChannels": "Mi trovi anche su",
            "howCanIHelpYou": "Sono aperto a:",
            "webDevelopment": "Sviluppo web, software e app",
            "webDevelopmentDescription": "Sviluppo di siti web, applicazioni web e software su misura.",
            "consulting": "Consulenza informatica",
            "consultingDescription": "Consulenza su problemi informatici, scelta di tecnologie e soluzioni.",
            "other": "Altro",
            "otherDescription": "Qualsiasi altra informazione o richiesta."
        },
        "footer": {
            "vatNumber": "Partita IVA"
        },
        "contact": {
            "yourEmail": "La tua email",
            "yourName": "Il tuo nome",
            "yourMessage": "Il tuo messaggio",
            "messagePlaceholder": "Scrivi qui il tuo messaggio...",
            "send": "Invia",
            "telegram": "Telegram",
            "email": "Email",
            "captchaError": "Captcha non valido",
            "success": "Messaggio inviato con successo, grazie",
            "sendError": "Errore durante l'invio del messaggio :("
        },
        "curriculum": {
            "infolog": {
                "date": "Luglio 2021",
                "job": "Sistemista",
                "description": "Sistemista presso l'azienda Infolog S.r.l. di Modena, dove ho lavorato con il team di sviluppo per la realizzazione di un'applicazione web per la gestione di un magazzino."
            },
            "seta": {
                "date": "Settembre 2021",
                "job": "Programmatore software",
                "description": "Stage presso l'azienda di trasporto pubblico di Modena SETA S.p.A., dove ho sviluppato il software per la generazione dei file audio per gli annunci a bordo dei bus. Ho inoltre eseguito un analisi dei dati per l'addestramento di un modello di machine learning per il conteggio dei passeggeri."
            },
            "fertec": {
                "date": "Marzo 2023",
                "job": "Programmatore web",
                "description": "Progettazione e sviluppo di soluzioni software avanzate, tra cui sistemi a microservizi per IoT, software di analisi dei costi, applicazioni mobili e web."
            },
            "freelance": {
                "date": "Presente",
                "job": "Sviluppatore Freelance",
                "description": "Sviluppo di siti web, applicazioni web e software su misura per privati e aziende."
            }
        },
        "projects": {
            "bamboosim": {
                "title": "BambooSIM",
                "description": "Un negozio online di eSIM con un CMS personalizzato per la gestione di prodotti, ordini e clienti. Integrazione con più gateway di pagamento e servizi cloud."
            },
            "ezaffitto": {
                "title": "ezaffitto",
                "description": "Raccoglitore completamente automatico di annunci di affitti provenienti da vari siti con parsing tramite AI (OpenAI) strutturato a microservizi."
            },
            "kinocafe": {
                "title": "Kinó Café",
                "description": "Sito web di un café per gestire ordini, stampare scontrini su una stampante POS, inviare dati a un ESP32 via Web Serial API, mostrare il menù, fungere come homepage e gestire la registrazione degli utenti."
            },
            "vhfesuperiori": {
                "title": "VHF e superiori",
                "description": "Un gestore di eventi e social network per radioamatori a cura di volontari. Un posto dove condividere le proprie creazioni, collegamenti (QSO) e conoscere nuove persone."
            },
            "occupalostudente": {
                "title": "Occupa lo Studente",
                "description": "Un'applicazione web per la ricerca di lavoro che mette in contatto aziende e studenti dell'I.T.I.S. E. Fermi di Modena. Login istituzionale tramite Google OAuth 2.0."
            },
            "tpldisplay": {
                "title": "TPL Display",
                "description": "Tabellone per le partenze autobus real-time, dockerizzato, interfacciato con i dati del TPL di Bologna e Modena, con caching (Redis) e aggiornamento automatico."
            },
            "wolfsurvival": {
                "title": "Wolf Survival",
                "description": "Sito di una scuola di sopravvivenza con frontend Next.js e backend connesso all'API di Meta (Facebook) per mostrare gli ultimi corsi, foto e video delle attività svolte."
            },
            "om": {
                "title": "Quiz O.M.",
                "description": "Quiz radioamatoriale per la preparazione all'esame per il conseguimento della patente di operatore di stazione radioamatoriale."
            }
        },
        "languages": {
            "full": {
                "it": "Italiano",
                "en": "English",
                "cs": "Čeština"
            },
            "flag": {
                "it": "🇮🇹",
                "en": "🇬🇧",
                "cs": "🇨🇿"
            }
        }
    }
}
